blog.org
#+title: Vuri's blog
#+author: vuri

#+hugo_auto_set_lastmod: t
#+hugo_base_dir: .
#+hugo_section: .

#+options: toc:2

** Emacs 之路                                                  :@emacs:emacs:
:properties:
:export_file_name: the-way-to-emacs
:end:

*** Setup with spacemacs

#+begin_src shell
  # 下载 emacs
  $ brew install --cask emacs

  # 推荐这个分支的 emacs 发行版，提供更好的原生 GUI 支持，下载对应所需的 release 版本
  # 解决 GUI 下的闪屏问题，更加丝滑
  # https://github.com/railwaycat/homebrew-emacsmacport

  # 启用 spacemacs 作为 emacs 的加载入口
  $ git clone https://github.com/syl20bnr/spacemacs spacemacs.d
  $ ln -s ~/dotfiles/spacemacs.d ~/.emacs.d

  # 启动 emacs（GUI模式），下载依赖
  $ emacs
  # 终端模式下：
  # $ emacs --nw

  # 将 spacemacs 的启动配置存到到自定义的 dotfiles 下，方便统一管理
  $ mkdir -p ~/dotfiles/.emacs.d
  $ mv ~/.spacemacs* ~/dotfiles/.emacs.d
  $ ln -s ~/dotfiles/.emacs.d/.spacemacs ~/.spacemacs
  $ ln -s ~/dotfiles/.emacs.d/.spacemacs.env ~/.spacemacs.env
#+end_src

*** Org mode

**** 语法

-----
Refs:

- [[https://orgmode.org/worg/org-syntax.html][org-syntax]]
**** 如何创建代码段

执行 ~, i b~ 弹出菜单选择框，再按 s ~s[src]~

#+BEGIN_SRC org
  ,#+BEGIN_SRC org
  ,#+END_SRC
#+END_SRC

**** 如何编辑代码段

~C-c '~ 进入编辑代码段界面， ~, c~ 保存修改， ~, k~ 撤销修改。

-----
Refs:
- [[https://orgmode.org/manual/Structure-of-Code-Blocks.html][Structure of Code Blocks]]
- [[https://andreyor.st/posts/2022-10-16-my-blogging-setup-with-emacs-and-org-mode/][setup-with-emacs-and-org-mode]]

**** TOC(Table of Contents)

-----
Refs:

- [[https://orgmode.org/manual/Table-of-Contents.html][Table-of-Contents]]

*** Markdown

**** 生成 TOC

执行 ~SPC SPC markdown-toc-generate-toc RET~

**** 预览

1. 安装 ~vmd~
  #+begin_src shell
    npm install -g vmd
  #+end_src
2. 配置实时预览引擎
   #+begin_src emacs-lisp
     dotspacemacs-configuration-layers '(
       (markdown :variables markdown-live-preview-engine 'vmd))
   #+end_src


*** Plugins

**** Treemacs

Repo: [[https://github.com/Alexander-Miller/treemacs][Treemacs]]

#+begin_quote
a tree layout file explorer for Emacs
#+end_quote

***** 如何使用

spacemacs 已经包含 treemacs layer，可以直接使用：

#+begin_src emacs-lisp
  dotspacemacs-configuration-layers
  '(treemacs :variables
             treemacs-use-git-mode 'deferred)
#+end_src

- 添加工程（Project）到工作空间（Workspace）中

  光标焦点移动到 Treemacs 窗口中，执行 =C-c C-p a= 或者 =SPC SPC treemacs-add-project RET=
  选择指定目录到工程中。

- 对工作空间的工程进行排序

  执行 =C-c C-w e= 或者 =SPC SPC treemacs-edit-workspaces RET= ，会弹出窗口对文件进行编辑：

  #+begin_src org
    ,#+TITLE: Edit Treemacs Workspaces & Projects
    # Call ~treemacs-finish-edit~ or press ~C-c C-c~ when done.
    # [[https://github.com/Alexander-Miller/treemacs#conveniently-editing-your-projects-and-workspaces][Click here for detailed documentation.]]
    # To cancel you can simply kill this buffer.

    ,* Default
    ,** dotfiles
     - path :: ~/dotfiles
  #+end_src

  确认编辑修改后， =C-c C-c= 进行保存并退出。

